j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Why should undocumented immigrants be allowed to stay?
   CLOSED: [2018-06-23 Sat 07:04]
   :PROPERTIES:
   :EXPORT_FILE_NAME: allow-to-stay
   :EXPORT_HUGO_MENU: "main"
   :END:

*** Question:
Many immigrants have followed the law and are in our country legally. Why should
undocumented immigrants who entered our country illegally be allowed to live
here?


*** Background:
Immigrants to the U.S. are undocumented for one of two reasons:
 - They have entered our country by crossing the border without being processed,
   which is a misdemeanor, or
 - They have entered our country with a visa, but have overstayed, which is a
   petty offense, and not a crime.

Neither of these reasons involves a felony, which is the most serious kind of
crime.

*** Answer:
The great majority of undocumented immigrants in Hawaii have overstayed their
visas and have done nothing illegal arising from their immigration status. Most
of them are living peaceably among us and are contributing to our economy and
local communities. Many of them have U.S. families, including native born
children, to whom they provide support. Deporting them breaks up families and
communities. It is better for all of us to give undocumented immigrants a path
to citizenship so they can continue to live peaceably among us.


