j20-immigration/content/post/allow-to-stay.md
+++
title = "Why should undocumented immigrants be allowed to stay?"
author = ["Hawaii J20"]
date = 2018-06-23T07:04:00-10:00
lastmod = 2018-08-04T18:04:08-10:00
draft = false
+++

## Question: {#question}

Many immigrants have followed the law and are in our country legally. Why should
undocumented immigrants who entered our country illegally be allowed to live
here?


## Background: {#background}

Immigrants to the U.S. are undocumented for one of two reasons:

-   They have entered our country by crossing the border without being processed,
    which is a misdemeanor, or
-   They have entered our country with a visa, but have overstayed, which is a
    petty offense, and not a crime.

Neither of these reasons involves a felony, which is the most serious kind of
crime.


## Answer: {#answer}

The great majority of undocumented immigrants in Hawaii have overstayed their
visas and have done nothing illegal arising from their immigration status. Most
of them are living peaceably among us and are contributing to our economy and
local communities. Many of them have U.S. families, including native born
children, to whom they provide support. Deporting them breaks up families and
communities. It is better for all of us to give undocumented immigrants a path
to citizenship so they can continue to live peaceably among us.
